{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4jrestclient import client\n",
    "from neo4jrestclient.client import GraphDatabase\n",
    "db = GraphDatabase(\"http://localhost:7474\",\"neo4j\", \"kot67neo4j\")\n",
    "## Create the labels if they don't already exist\n",
    "actors = db.labels.create(\"Actor\")\n",
    "directors = db.labels.create(\"Director\")\n",
    "movies = db.labels.create(\"Movie\")\n",
    "\n",
    "## create the new nodes\n",
    "keanu = db.nodes.create(name=\"Keanu Reeves\")\n",
    "johnwick = db.nodes.create(title=\"John Wick\")\n",
    "dafoe = db.nodes.create(name=\"William Dafoe\")\n",
    "nyquist = db.nodes.create(name=\"Michael Nyquist\")\n",
    "stahelski = db.nodes.create(name=\"Chad Stahelski\")\n",
    "leitch = db.nodes.create(name=\"David Leitch\")\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "## add the nodes with the appropriate label to the graph\n",
    "actors.add(nyquist, dafoe, keanu)\n",
    "directors.add(stahelski, leitch)\n",
    "movies.add(johnwick)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Neo4j Node: http://localhost:7474/db/data/node/220>\n<Neo4j Node: http://localhost:7474/db/data/node/190>\n"
     ]
    }
   ],
   "source": [
    "## get the existing node of Keanu Reeves\n",
    "keanu_query = actors.get(name=\"Keanu Reeves\")[0]\n",
    "print(keanu)\n",
    "print(keanu_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Neo4j Relationship: http://localhost:7474/db/data/relationship/265>"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "## add the relationships using the shorthand notation function\n",
    "keanu.ACTS_IN(johnwick)\n",
    "dafoe.ACTS_IN(johnwick)\n",
    "nyquist.ACTS_IN(johnwick)\n",
    "stahelski.DIRECTS_IN(johnwick)\n",
    "leitch.DIRECTS_IN(johnwick)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "ename": "SyntaxError",
     "evalue": "invalid syntax (<ipython-input-35-ae7795115f9b>, line 10)",
     "traceback": [
      "\u001b[1;36m  File \u001b[1;32m\"<ipython-input-35-ae7795115f9b>\"\u001b[1;36m, line \u001b[1;32m10\u001b[0m\n\u001b[1;33m    query = \"MATCH (keanu:Actor)-[:ACTS_IN]->(movie:Movie),(director:Director)-[:DIRECTS_IN]->(movie) WHERE keanu.name = 'Keanu Reeves' RETURN DISTINCT(director.name)\"\u001b[0m\n\u001b[1;37m        ^\u001b[0m\n\u001b[1;31mSyntaxError\u001b[0m\u001b[1;31m:\u001b[0m invalid syntax\n"
     ],
     "output_type": "error"
    }
   ],
   "source": [
    "## Find all actors in movies with Keanu Reeves\n",
    "query = \"MATCH (keanu:Actor)-[:ACTS_IN]->(movie:Movie),(coActor:Actor)-[:ACTS_IN]->(movie) WHERE keanu.name = 'Keanu Reeves' return DISTINCT(coActor.name)\"\n",
    "results = db.query(query, data_contents=True)\n",
    "## Flatten list of lists return format\n",
    "values = [item for sublist in results.rows for item in sublist]\n",
    "## Print values\n",
    "print(\"Keanu acts with: \"+', '.join(values)\n",
    "\n",
    "##Find all directors of movies with Keanu Reeves\n",
    "query = \"MATCH (keanu:Actor)-[:ACTS_IN]->(movie:Movie),(director:Director)-[:DIRECTS_IN]->(movie) WHERE keanu.name = 'Keanu Reeves' RETURN DISTINCT(director.name)\"\n",
    "\n",
    "results = db.query(query, data_contents=True)\n",
    "\n",
    "## Flatten list of lists return format\n",
    "values = [item for sublist in results.rows for item in sublist]\n",
    "## Print values\n",
    "print('Keanu is directed by: '+', '.join(values))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"MATCH (keanu:Actor)-[:ACTS_IN]->(movie:Movie),(director:Director)-[:DIRECTS_IN]->(movie) WHERE keanu.name = 'Keanu Reeves' return DISTINCT(director.name)\""
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "## Get lists of all the things we care about in the db\n",
    "allActors = actors.all()\n",
    "allDirectors = directors.all()\n",
    "allMovies = movies.all()\n",
    "allRelationships = db.relationships.all()[:]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'name': 'Michael Nyquist'}\n{'name': 'William Dafoe'}\n{'name': 'Keanu Reeves'}\n{'name': 'Michael Nyquist'}\n{'name': 'Michael Nyquist'}\n{'name': 'William Dafoe'}\n{'name': 'Keanu Reeves'}\n{'name': 'William Dafoe'}\n{'name': 'Keanu Reeves'}\n"
     ]
    }
   ],
   "source": [
    "for i in allActors:\n",
    "    print(i.properties)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'name': 'David Leitch'}\n{'name': 'Chad Stahelski'}\n{'name': 'David Leitch'}\n{'name': 'Chad Stahelski'}\n{'name': 'David Leitch'}\n{'name': 'Chad Stahelski'}\n"
     ]
    }
   ],
   "source": [
    "for i in allDirectors:\n",
    "    print(i.properties)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [],
   "source": [
    "for i in allMovies:\n",
    "    print(i.properties)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Keanu Reeves\nACTS_IN\nJohn Wick\n{}\n ----- \n\nWilliam Dafoe\nACTS_IN\nJohn Wick\n{}\n ----- \n\nChad Stahelski\nDIRECTS_IN\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "John Wick\n{}\n ----- \n\nKeanu Reeves\nACTS_IN\nJohn Wick\n{}\n ----- \n\nMichael Nyquist\nACTS_IN\nJohn Wick\n{}\n ----- \n\nDavid Leitch\nDIRECTS_IN\nJohn Wick\n{}\n ----- \n\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "William Dafoe\nACTS_IN\nJohn Wick\n{}\n ----- \n\nChad Stahelski\nDIRECTS_IN\nJohn Wick\n{}\n ----- \n\nMichael Nyquist"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\nACTS_IN\nJohn Wick\n{}\n ----- \n\nDavid Leitch\nDIRECTS_IN\nJohn Wick\n{}\n ----- \n\nKeanu Reeves\nACTS_IN\nJohn Wick\n{}\n ----- \n\nMichael Nyquist\nACTS_IN\nJohn Wick\n{}\n ----- \n\nDavid Leitch\nDIRECTS_IN\nJohn Wick\n{}\n ----- \n\nWilliam Dafoe\nACTS_IN\nJohn Wick\n{}\n ----- \n\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Chad Stahelski\nDIRECTS_IN\nJohn Wick\n{}\n ----- \n\n"
     ]
    }
   ],
   "source": [
    "for i in allRelationships:\n",
    "    print(i.start['name'])\n",
    "    print(i.type)\n",
    "    print(i.end['title'])\n",
    "    print(i.properties)\n",
    "    print(' ----- ')\n",
    "    print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4jrestclient.client.GraphDatabase at 0x9a65748>"
      ]
     },
     "execution_count": 47,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from neo4jrestclient import client\n",
    "from neo4jrestclient.client import GraphDatabase\n",
    "GraphDatabase(\"http://localhost:7474\",\"neo4j\", \"kot67neo4j\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher http://neo4j:kot67neo4j@localhost:7474\n",
    "MATCH (n)\n",
    "RETURN n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "199998\nWall time: 30.5 ms\n"
     ]
    }
   ],
   "source": [
    ""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
